mikecarper/Adafruit_nRF52_Bootloader_OTAFIX/src/main.c
  // Populate Boot Address and MBR Param into MBR if not already
  // MBR_BOOTLOADER_ADDR/MBR_PARAM_PAGE_ADDR are used if available, else UICR registers are used
  // Note: skip it for now since this will prevent us to change the size of bootloader in the future
  // bootloader_mbr_addrs_populate();

  // Save bootloader version to pre-defined register, retrieved by application
  // TODO move to CF2
  BOOTLOADER_VERSION_REGISTER = (MK_BOOTLOADER_VERSION);

  board_init();
  bootloader_init();
  PRINTF("Bootloader Start\r\n");
  led_state(STATE_BOOTLOADER_STARTED);

  // When updating SoftDevice, bootloader will reset before swapping SD
  if (bootloader_dfu_sd_in_progress()) {
    led_state(STATE_WRITING_STARTED);

    bootloader_dfu_sd_update_continue();
    bootloader_dfu_sd_update_finalize();

    led_state(STATE_WRITING_FINISHED);

    // COPY_BL/COPY_SD resumes execution in the replacement image before all
    // MBR/SoftDevice peripheral state is clean for direct NVMC or USB access.
    // Finalization clears the pending bank state. Clear the stale BLE transport
    // request left by reset_callback() before resetting, or the replacement
    // bootloader re-enters BLE DFU instead of launching the application.
    NRF_POWER->GPREGRET = 0;
    NVIC_SystemReset();
  }

  // Check all inputs and enter DFU if needed
  // Return when DFU process is complete (or not entered at all)
  check_dfu_mode();

  // Check if we must reenter the bootloader after reset, instead of
  // launching the user application
  bool bootloader_must_be_reentered = bootloader_must_reset_to_self();

  // Every completed application update must reboot through reset so the app
  // starts with clean USB, SoftDevice, radio, and peripheral state. This is
  // required by BLE and also prevents a completed UF2/CDC transfer from
  // direct-jumping out of a live USB stack. Interrupted updates keep using the
  // recovery path below.
  bool const reset_after_app_update = bootloader_dfu_app_update_complete();

  // Reset peripherals
  board_teardown();

  if (reset_after_app_update) {
    NVIC_SystemReset();
  }

  // MeshCore OTA: if a verified+approved .mota was staged for this firmware, apply it in place now
  // (SoftDevice is off here; safe to rewrite the single app slot). On success, reset to boot the new
  // image; on any failure the app region is left for the validity check below to route to DFU.
  if ( ota_delta_check_and_apply() ) {
    NVIC_SystemReset();
  }
  board_watchdog_teardown();

  /* Jump to application if valid
   * "Master Boot Record and SoftDevice initializaton procedure"
   * - SD_MBR_COMMAND_INIT_SD (if not already)
   * - sd_softdevice_disable()
   * - sd_softdevice_vector_table_base_set(APP_ADDR)
   * - jump to App reset
   */
  if (!bootloader_must_be_reentered &&
       bootloader_app_is_valid() &&
      !bootloader_dfu_sd_in_progress()) {
    PRINTF("App is valid\r\n");
    if (is_sd_existed()) {
      // MBR forward IRQ to SD (if not already)
      if (!_sd_inited) mbr_init_sd();

      // Make sure SD is disabled
      disable_softdevice();
    }

    // clear in case we kept DFU_DBL_RESET_APP there
    (*dbl_reset_mem) = 0;

    // start application
    PRINTF("Starting app...\r\n");
    bootloader_app_start();
  }

  // No application was loaded or we need to reenter the bootloader

  // Reset the system with the OTA DFU update in case we were in it,
  // to allow completion of FLASHING, otherwise, default to normal reset
  if (_ota_was_connected) {
    NRF_POWER->GPREGRET = DFU_MAGIC_OTA_RESET;
  }

  NVIC_SystemReset();
}

static void check_dfu_mode(void) {
  uint32_t const gpregret = NRF_POWER->GPREGRET;

  // SD is already Initialized in case of BOOTLOADER_DFU_OTA_MAGIC
  _sd_inited = (gpregret == DFU_MAGIC_OTA_APPJUM);

  // Start Bootloader in BLE OTA mode
  _ota_dfu = (gpregret == DFU_MAGIC_OTA_APPJUM) || (gpregret == DFU_MAGIC_OTA_RESET);

  // Serial only mode
  bool const serial_only_dfu = (gpregret == DFU_MAGIC_SERIAL_ONLY_RESET);
  bool const uf2_dfu         = (gpregret == DFU_MAGIC_UF2_RESET);
  bool const dfu_skip        = (gpregret == DFU_MAGIC_SKIP);

  bool const reason_reset_pin = (NRF_POWER->RESETREAS & POWER_RESETREAS_RESETPIN_Msk) ? true : false;
  bool const double_reset = ((*dbl_reset_mem) == DFU_DBL_RESET_MAGIC) && reason_reset_pin;

  // start either serial, uf2 or ble
  bool dfu_start = _ota_dfu || serial_only_dfu || uf2_dfu ||
                   (((*dbl_reset_mem) == DFU_DBL_RESET_MAGIC) && reason_reset_pin);

  // Clear GPREGRET if it is our values
  if (dfu_start || dfu_skip) {
    NRF_POWER->GPREGRET = 0;
  }

  // skip dfu entirely
  if (dfu_skip) {
    return;
  }

  /*------------- Determine DFU mode (Serial, OTA, FRESET or normal) -------------*/
  // DFU button pressed
#if defined(BUTTON_DFU)
  dfu_start = dfu_start || button_pressed(BUTTON_DFU);
#endif

  // DFU + FRESET are pressed --> OTA
#if defined(BUTTON_DFU) && defined(BUTTON_DFU_OTA)
  _ota_dfu = _ota_dfu || (button_pressed(BUTTON_DFU) && button_pressed(BUTTON_DFU_OTA));
#endif

  bool const valid_app = bootloader_app_is_valid();
  bool const just_start_app = valid_app && !dfu_start && (*dbl_reset_mem) == DFU_DBL_RESET_APP;
  bool const app_single_tap = APP_ASKS_FOR_SINGLE_TAP_RESET();

  if (!just_start_app && app_single_tap) {
    dfu_start = 1;
  }

#ifdef DEFAULT_TO_OTA_DFU
  // Default to OTA DFU mode, instead of Serial DFU mode, if there is no app present,
  // because otherwise, if there is no application, it will restart in Serial DFU mode,
  // making it IMPOSSIBLE to recover devices in the field if there are no user
  // accessible USB ports
  if ((!valid_app || dfu_start) && !serial_only_dfu && !uf2_dfu) {
    _ota_dfu = 1;
  }
#endif

  // App mode: Double Reset detection or DFU startup for nrf52832
  if (!(just_start_app || dfu_start)) { // removed !valid_app check to allow double reset even when no app
#ifdef NRF52832_XXAA
    /* Even DFU is not active, we still force an 1000 ms dfu serial mode when startup
     * to support auto programming from Arduino IDE
     * Note: Double Reset WONT work with nrf52832 since all its SRAM got cleared with GPIO reset. */
    bootloader_dfu_start(false, DFU_SERIAL_STARTUP_INTERVAL, false);
#else
    // Note: RESETREAS is not clear by bootloader, it should be cleared by application upon init()
    if (reason_reset_pin) {
      // Register our first reset for double reset detection
      (*dbl_reset_mem) = DFU_DBL_RESET_MAGIC;

      // if RST is pressed during this delay (double reset)--> if will enter dfu
      NRFX_DELAY_MS(DFU_DBL_RESET_DELAY);
    }
#endif
  }

  if (app_single_tap) {
    (*dbl_reset_mem) = DFU_DBL_RESET_APP;
  } else {
    (*dbl_reset_mem) = 0;
  }

