mikecarper/Adafruit_nRF52_Bootloader_OTAFIX/src/main.c
  // With no application and no explicitly requested transport, briefly offer
  // USB first. If an active host does not enumerate us, fall back to BLE OTA.
  bool const probe_usb = !valid_app && !_ota_dfu && !serial_only_dfu && !uf2_dfu && !double_reset;

  if ((dfu_start || !valid_app) && !serial_only_dfu && !uf2_dfu && !double_reset && !probe_usb) {
    _ota_dfu = true; // set default to OTA only when no explicit UF2/serial/dbl-reset
  }

  // Enter DFU mode accordingly to input
  if (dfu_start || !valid_app) {
    if (!_ota_dfu) {
      // A buttonless handoff can leave the SoftDevice enabled even when a
      // later recovery decision selects USB. Direct NVMC access from the
      // CDC/UF2 transports would then raise a bus fault on the first flash
      // write. USB owns no SoftDevice resources, so make that boundary
      // explicit before initializing TinyUSB.
      disable_softdevice();
      _sd_inited = false;
    }

    if (probe_usb) {
      led_state(STATE_USB_UNMOUNTED);
      usb_init(false);

      if (!usb_wait_for_mount(DFU_USB_ENUMERATION_TIMEOUT_MS)) {
        usb_teardown();
        _ota_dfu = true;
      }
    }

    if (_ota_dfu) {
      #ifdef DISPLAY_PIN_SCK
        board_display_init();
        screen_draw_ble();
      #endif
      led_state(STATE_BLE_DISCONNECTED);
      if (!_sd_inited) mbr_init_sd();
      _sd_inited = true;
      ble_stack_init();
    } else if (!probe_usb) {
      led_state(STATE_USB_UNMOUNTED);
      usb_init(serial_only_dfu);
    }

    // Initiate an update of the firmware.
    if (app_single_tap || uf2_dfu || serial_only_dfu) {
      // Explicit 0x4E/0x57 entry gets the complete host-enumeration window;
      // MakeCode-style single-tap entry intentionally remains brief.
      uint32_t const timeout_ms = dfu_buttonless_timeout_ms(serial_only_dfu, uf2_dfu);
      bootloader_dfu_start(_ota_dfu, timeout_ms, true);
    } else {
      // No timeout if bootloader requires user action (double-reset). A
      // no-application USB probe still exits when VBUS is removed so the next
      // reset can fall back to BLE recovery without requiring a reset button.
      bootloader_dfu_start(_ota_dfu, 0, probe_usb);
    }

    if (_ota_dfu) {
      disable_softdevice();
      usb_teardown(); // allow booting to app after ota even if usb is connected
    } else {
      usb_teardown();
    }
  }
}

//--------------------------------------------------------------------+
// BLE
//--------------------------------------------------------------------+

// Initializes the SoftDevice by following SD specs section
// "Master Boot Record and SoftDevice initializaton procedure"
static uint32_t ble_stack_init(void) {
  // Forward vector table to bootloader address so that we can handle BLE events
  sd_softdevice_vector_table_base_set(BOOTLOADER_REGION_START);

  // Enable Softdevice, Use Internal OSC to compatible with all boards
  nrf_clock_lf_cfg_t clock_cfg = {
      .source       = NRF_CLOCK_LF_SRC_RC,
      .rc_ctiv      = 16,
      .rc_temp_ctiv = 2,
      .accuracy     = NRF_CLOCK_LF_ACCURACY_250_PPM
  };
  #ifdef ANT_LICENSE_KEY
    sd_softdevice_enable(&clock_cfg, app_error_fault_handler, ANT_LICENSE_KEY);
  #else
    sd_softdevice_enable(&clock_cfg, app_error_fault_handler);
  #endif
  sd_nvic_EnableIRQ(SD_EVT_IRQn);

  /*------------- Configure BLE params  -------------*/
  extern uint32_t __data_start__[]; // defined in linker
  uint32_t ram_start = (uint32_t) __data_start__;

  ble_cfg_t blecfg;

  // Configure the maximum number of connections.
  varclr(&blecfg);
  blecfg.gap_cfg.role_count_cfg.adv_set_count = 1;
  blecfg.gap_cfg.role_count_cfg.periph_role_count = 1;
  blecfg.gap_cfg.role_count_cfg.central_role_count = 0;
  blecfg.gap_cfg.role_count_cfg.central_sec_count = 0;
  sd_ble_cfg_set(BLE_GAP_CFG_ROLE_COUNT, &blecfg, ram_start);

  // NRF_DFU_BLE_REQUIRES_BONDS
  varclr(&blecfg);
  blecfg.gatts_cfg.service_changed.service_changed = 1;
  sd_ble_cfg_set(BLE_GATTS_CFG_SERVICE_CHANGED, &blecfg, ram_start);

  // ATT MTU
  varclr(&blecfg);
  blecfg.conn_cfg.conn_cfg_tag = BLE_CONN_CFG_HIGH_BANDWIDTH;
  blecfg.conn_cfg.params.gatt_conn_cfg.att_mtu = BLEGATT_ATT_MTU_MAX;
  sd_ble_cfg_set(BLE_CONN_CFG_GATT, &blecfg, ram_start);

  // Event Length + HVN queue + WRITE CMD queue setting affecting bandwidth
  varclr(&blecfg);
  blecfg.conn_cfg.conn_cfg_tag = BLE_CONN_CFG_HIGH_BANDWIDTH;
  blecfg.conn_cfg.params.gap_conn_cfg.conn_count = 1;
  blecfg.conn_cfg.params.gap_conn_cfg.event_length = BLEGAP_EVENT_LENGTH;
  sd_ble_cfg_set(BLE_CONN_CFG_GAP, &blecfg, ram_start);

  // HVN queue size
  varclr(&blecfg);
  blecfg.conn_cfg.conn_cfg_tag = BLE_CONN_CFG_HIGH_BANDWIDTH;
  blecfg.conn_cfg.params.gatts_conn_cfg.hvn_tx_queue_size = BLEGATTS_HVN_QSIZE;
  sd_ble_cfg_set(BLE_CONN_CFG_GATTS, &blecfg, ram_start);

  // WRITE COMMAND queue size
  varclr(&blecfg);
  blecfg.conn_cfg.conn_cfg_tag = BLE_CONN_CFG_HIGH_BANDWIDTH;
  blecfg.conn_cfg.params.gattc_conn_cfg.write_cmd_tx_queue_size = BLEGATTC_WRCMD_QSIZE;
  sd_ble_cfg_set(BLE_CONN_CFG_GATTC, &blecfg, ram_start);

  // Enable BLE stack.
  // Note: Interrupt state (enabled, forwarding) is not work properly if not enable ble
  sd_ble_enable(&ram_start);

#if BLEGATT_ATT_MTU_MAX > 23 || defined(GPIO_PA_PIN) || defined(GPIO_LNA_PIN)
  ble_opt_t  opt;
#endif

#if BLEGATT_ATT_MTU_MAX > 23
  varclr(&opt);
  opt.common_opt.conn_evt_ext.enable = 1; // enable Data Length Extension
  sd_ble_opt_set(BLE_COMMON_OPT_CONN_EVT_EXT, &opt);
#endif

#if defined(GPIO_PA_LNA_MODE_PIN)
  // Set PA / LNA Mode Pin: Low for Normal operation
  nrf_gpio_cfg_output(GPIO_PA_LNA_MODE_PIN);
  nrf_gpio_pin_clear(GPIO_PA_LNA_MODE_PIN);
#endif

#if defined(GPIO_PA_LNA_SELECT_PIN)
  // Set PA / LNA Select Pin: low for u.FL
  nrf_gpio_cfg_output(GPIO_PA_LNA_SELECT_PIN);
  nrf_gpio_pin_clear(GPIO_PA_LNA_SELECT_PIN);
#endif

  // Configure SoftDevice PA / LNA assist if required
#if defined(GPIO_PA_PIN) || defined(GPIO_LNA_PIN)

  static const uint32_t gpio_toggle_ch = 0;
  static const uint32_t ppi_set_ch = 0;
  static const uint32_t ppi_clr_ch = 1;

  varclr(&opt);

